docs/benchmarks/nop/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-31 czw 10:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Measuring CPU clock speed with NOPs and time(1)</title>
<meta name="author" content="Krzysztof Piecuch" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Measuring CPU clock speed with NOPs and time(1)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org89798e4">1. Introduction</a></li>
<li><a href="#orge3acedc">2. Benchmark</a>
<ul>
<li><a href="#org244818b">2.1. Code</a></li>
<li><a href="#orgef3f665">2.2. Running it freely</a>
<ul>
<li><a href="#org207f8dd">2.2.1. Results analysis:</a></li>
<li><a href="#orge452f36">2.2.2. Conclusions:</a></li>
</ul>
</li>
<li><a href="#org555d52b">2.3. Running it at fixed 1GHz speed</a>
<ul>
<li><a href="#orgb90553e">2.3.1. Result analysis</a></li>
<li><a href="#org3d393d6">2.3.2. Conclusions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd1a2300">3. Bonus: bogomips</a></li>
</ul>
</div>
</div>

<div id="outline-container-org89798e4" class="outline-2">
<h2 id="org89798e4"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://brendangregg.com/blog/2014-04-26/the-noploop-cpu-benchmark.html">Brendan Gregg published</a> a simple CPU benchmark for checking your cpu speed. I decided to give it a go and see for myself. Even for a simple thing like that it turned out a little different than I expected.
</p>
</div>
</div>
<div id="outline-container-orge3acedc" class="outline-2">
<h2 id="orge3acedc"><span class="section-number-2">2.</span> Benchmark</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org244818b" class="outline-3">
<h3 id="org244818b"><span class="section-number-3">2.1.</span> Code</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Instead of writing C-code and then editing asm/binary I opted for writing my own assembly. I don't need to lookup gcc flags or read through the boilerplate generated by GCC.
</p>

<p>
I prefer Intel asm syntax over AT&amp;T, I think Intel is more readable for humans.
</p>

<div class="org-src-container">
<pre class="src src-asm" id="orgfdfc5fd"><span style="color: #cae682;">section</span> .text
<span style="color: #cae682;">global</span> _start
<span style="color: #cae682;">SYS_EXIT</span> <span style="color: #8ac6f2; font-weight: bold;">equ</span> 1
<span style="color: #cae682;">ARG</span> <span style="color: #8ac6f2; font-weight: bold;">equ</span> 1048576000

<span style="color: #cae682;">_start</span>:
        <span style="color: #8ac6f2; font-weight: bold;">mov</span> eax, ARG   <span style="color: #99968b;">; </span><span style="color: #99968b;">store the number of loops in the register</span>
<span style="color: #cae682;">loop</span>:   <span style="color: #8ac6f2; font-weight: bold;">nop</span>            <span style="color: #99968b;">; </span><span style="color: #99968b;">do nothing, burn cycles</span>
        <span style="color: #8ac6f2; font-weight: bold;">nop</span>
        <span style="color: #8ac6f2; font-weight: bold;">nop</span>
<span style="color: #99968b;">;       </span><span style="color: #99968b;">&lt;snip&gt;  ;total of 2048 NOPs</span>
        <span style="color: #8ac6f2; font-weight: bold;">nop</span>
        <span style="color: #8ac6f2; font-weight: bold;">add</span> eax, -1     <span style="color: #99968b;">; </span><span style="color: #99968b;">subtract 1 from loop counter</span>
        <span style="color: #8ac6f2; font-weight: bold;">cmp</span> eax, 0      <span style="color: #99968b;">; </span><span style="color: #99968b;">test if loop counter is 0</span>
        <span style="color: #8ac6f2; font-weight: bold;">jne</span> loop        <span style="color: #99968b;">; </span><span style="color: #99968b;">go back to the nops if not finished</span>
<span style="color: #cae682;">end</span>:    <span style="color: #8ac6f2; font-weight: bold;">mov</span> eax, SYS_EXIT       <span style="color: #99968b;">; </span><span style="color: #99968b;">we want exit(2)</span>
        <span style="color: #8ac6f2; font-weight: bold;">int</span> 0x80                <span style="color: #99968b;">; </span><span style="color: #99968b;">we want it now</span>
</pre>
</div>
<p>
Compiling and linking it:
</p>
<div class="org-src-container">
<pre class="src src-bash" id="org8fdd79f">nasm -f elf64 main.asm
ld -o main main.o
</pre>
</div>
</div>
</div>
<div id="outline-container-orgef3f665" class="outline-3">
<h3 id="orgef3f665"><span class="section-number-3">2.2.</span> Running it freely</h3>
<div class="outline-text-3" id="text-2-2">
<p>
I used taskset to ensure my workload won't get moved to a different CPU. I want to benchmark one core, have hot caches. Moving the task across CPUs could introduce cache misses or reduce core temperature. I imagine running on core #1 for a while could heat it up, which would result in core frequency reduction. This may cause the kernel to move move the workload to faster core #2, wait a bit, move to core #3 etc&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-bash" id="orgb74723d">taskset 1 time ./main 2&gt;&amp;1
</pre>
</div>

<pre class="example" id="orgd93c072">
115.34user 0.00system 1:55.36elapsed 99%CPU (0avgtext+0avgdata 300maxresident)k
0inputs+0outputs (0major+14minor)pagefaults 0swaps
</pre>
</div>


<div id="outline-container-org207f8dd" class="outline-4">
<h4 id="org207f8dd"><span class="section-number-4">2.2.1.</span> Results analysis:</h4>
<div class="outline-text-4" id="text-2-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">What</th>
<th scope="col" class="org-left">How to calculate</th>
<th scope="col" class="org-right">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Instructions</td>
<td class="org-left">2048 * 1048576000</td>
<td class="org-right">2147483648000</td>
</tr>

<tr>
<td class="org-left">Time[s]</td>
<td class="org-left">time(1)</td>
<td class="org-right">115.34</td>
</tr>

<tr>
<td class="org-left">NOPs/s/4</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">4654681000</td>
</tr>
</tbody>
</table>

<p>
How does that compare to my CPU?
</p>

<div class="org-src-container">
<pre class="src src-bash" id="orge1a8a8b">head /proc/cpuinfo
cpupower -c 0 frequency-info
</pre>
</div>

<pre class="example" id="org5568b1c">
processor	: 0
vendor_id	: GenuineIntel
cpu family	: 6
model		: 140
model name	: 11th Gen Intel(R) Core(TM) i7-1165G7 @ 2.80GHz
stepping	: 1
microcode	: 0x9a
cpu MHz		: 2800.000
cache size	: 12288 KB
physical id	: 0
analyzing CPU 0:
  driver: intel_pstate
  CPUs which run at the same hardware frequency: 0
  CPUs which need to have their frequency coordinated by software: 0
  maximum transition latency:  Cannot determine or is not supported.
  hardware limits: 400 MHz - 4.70 GHz
  available cpufreq governors: performance powersave
  current policy: frequency should be within 400 MHz and 4.70 GHz.
                  The governor "performance" may decide which speed to use
                  within this range.
  current CPU frequency: Unable to call hardware
  current CPU frequency: 1.25 GHz (asserted by call to kernel)
  boost state support:
    Supported: yes
    Active: yes
</pre>

<p>
Here's my CPU's specification on Intel page:  <a href="https://ark.intel.com/content/www/us/en/ark/products/208921/intel-core-i71165g7-processor-12m-cache-up-to-4-70-ghz-with-ipu.html">https://ark.intel.com/content/www/us/en/ark/products/208921/intel-core-i71165g7-processor-12m-cache-up-to-4-70-ghz-with-ipu.html</a>
</p>
</div>
</div>

<div id="outline-container-orge452f36" class="outline-4">
<h4 id="orge452f36"><span class="section-number-4">2.2.2.</span> Conclusions:</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
So a 4.65GHz clock speed is within plausible results but that would mean that:
</p>
<ol class="org-ol">
<li>Top CPU speed range advertised by Intel is actually reachable</li>
<li>A compact laptop with questionable heat tolerance can sustain top CPU speed for 2 minutes</li>
</ol>

<p>
This might be true, especially because NOPs don't need a lot of power power to run but I tend to not believe vendor-advertised top specs.
</p>

<p>
Maybe my CPU can execute 5 or 6 NOPs in parallel?
</p>

<p>
Let's fix the frequency at some low value and have a look at results.
</p>
</div>
</div>
</div>

<div id="outline-container-org555d52b" class="outline-3">
<h3 id="org555d52b"><span class="section-number-3">2.3.</span> Running it at fixed 1GHz speed</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-bash" id="org425e8b1">sudo cpupower -c 0 frequency-set --min 1000MHz --max 1000MHz
cpupower -c 0 frequency-info
taskset 1 time ./main 2&gt;&amp;1
</pre>
</div>

<pre class="example" id="orgf2cff2a">
Setting cpu: 0
analyzing CPU 0:
  driver: intel_pstate
  CPUs which run at the same hardware frequency: 0
  CPUs which need to have their frequency coordinated by software: 0
  maximum transition latency:  Cannot determine or is not supported.
  hardware limits: 400 MHz - 4.70 GHz
  available cpufreq governors: performance powersave
  current policy: frequency should be within 1000 MHz and 1000 MHz.
                  The governor "performance" may decide which speed to use
                  within this range.
  current CPU frequency: Unable to call hardware
  current CPU frequency: 2.35 GHz (asserted by call to kernel)
  boost state support:
    Supported: yes
    Active: yes
511.81user 0.03system 8:32.55elapsed 99%CPU (0avgtext+0avgdata 244maxresident)k
0inputs+0outputs (0major+13minor)pagefaults 0swaps
</pre>
</div>

<div id="outline-container-orgb90553e" class="outline-4">
<h4 id="orgb90553e"><span class="section-number-4">2.3.1.</span> Result analysis</h4>
<div class="outline-text-4" id="text-2-3-1">
<ol class="org-ol">
<li><p>
Frequency artifacts
</p>

<p>
The same command says that <code>frequency should be within 1000 MHz and
   1000 MHz.</code> and <code>current CPU frequency: 2.35 GHz (asserted by call
   to kernel)</code>. What do I make out of this?
</p>

<p>
I ran the command a couple of more times and got various results while the core was <b>idle</b>:
1.65GHz, 1.56GHz, 1.31GHz, 1.12GHz. It looks like the CPU does what it wants.
</p>

<p>
Sampling frequency once will not give precise results. You need to
sample it a couple of times and run some statistics to get
meaningful results. Let's see what happens under load.
</p></li>

<li><p>
Frequency is actually pretty stable
</p>

<p>
During the benchmark I ran <code>while sleep 2; do cpupower monitor;
   done</code> to monitor whether core 0 frequency is actually around 1GHz. I got something like that:
</p>
<pre class="example" id="org78bd3d2">
   | Nehalem                   || Mperf              || Idle_Stats
CPU| C3   | C6   | PC3  | PC6  || C0   | Cx   | Freq || POLL | C1_A | C2_A | C3_A
  0|  0.00|  0.00|  0.00|  0.00|| 99.60|  0.40|  1014||  0.00|  0.00|  0.00|  0.00
  1|  0.00|  0.00|  0.00|  0.00||  0.60| 99.40|  2331||  0.00|  0.04|  7.08| 92.26
  2|  0.00|  0.00|  0.00|  0.00||  0.30| 99.70|   855||  0.00|  0.04|  0.21| 99.46
  3|  0.00|  0.00|  0.00|  0.00||  0.53| 99.47|   859||  0.00|  0.06|  3.00| 96.43
  4|  0.00|  0.00|  0.00|  0.00||  0.75| 99.25|   909||  0.00|  0.13|  3.64| 95.50
  5|  0.00|  0.00|  0.00|  0.00||  0.74| 99.26|   858||  0.00|  0.44|  2.93| 95.93
  6|  0.00|  0.00|  0.00|  0.00||  0.26| 99.74|   882||  0.00|  0.10|  0.00| 99.65
  7|  0.00|  0.00|  0.00|  0.00||  0.43| 99.57|   910||  0.00|  0.78|  0.70| 98.12
</pre>

<p>
It looked like core #0 was consistently clocking around 1GHz while under sustained load.
</p>

<p>
An interesting detail is that core #1 is clocking at over
2GHz. We've got hyperthreading so core #0 is tied to core #1. It
might be that frequency scaler sees that there's a high demand on
CPU power and ramps up the CPU speed, but core #0 has a limited
speed. Note that thread #0 is busy and thread #1 is idle (C0 means
"busy", Cx means "idle", as per <a href="https://github.com/torvalds/linux/blob/d888c83fcec75194a8a48ccd283953bdba7b2550/tools/power/cpupower/utils/idle_monitor/mperf_monitor.c#L38-L61=">linux source code</a>).
</p></li>

<li># of NOPs / time</li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">What</th>
<th scope="col" class="org-left">How to calculate</th>
<th scope="col" class="org-right">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Instructions</td>
<td class="org-left">2048 * 1048576000</td>
<td class="org-right">2147483648000</td>
</tr>

<tr>
<td class="org-left">Time[s]</td>
<td class="org-left">time(1)</td>
<td class="org-right">511.81</td>
</tr>

<tr>
<td class="org-left">NOPs/s/4</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1048965300</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3d393d6" class="outline-4">
<h4 id="org3d393d6"><span class="section-number-4">2.3.2.</span> Conclusions</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
it looks like we clocked on average a little over 1GHz and indeed we can still run 4 NOPs per second.
</p>

<p>
So indeed, two conclusions in the previous benchmaks proved to be true!
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd1a2300" class="outline-2">
<h2 id="orgd1a2300"><span class="section-number-2">3.</span> Bonus: bogomips</h2>
<div class="outline-text-2" id="text-3">
<p>
The Linux Kernel exports 'bogomips' through /proc/cpuinfo
</p>
<div class="org-src-container">
<pre class="src src-sh" id="org0b9e957">head -n28 /proc/cpuinfo
grep bogomips /proc/cpuinfo
</pre>
</div>

<pre class="example" id="org4327e0f">
processor	: 0
vendor_id	: GenuineIntel
cpu family	: 6
model		: 140
model name	: 11th Gen Intel(R) Core(TM) i7-1165G7 @ 2.80GHz
stepping	: 1
microcode	: 0x9a
cpu MHz		: 2800.000
cache size	: 12288 KB
physical id	: 0
siblings	: 8
core id		: 0
cpu cores	: 4
apicid		: 0
initial apicid	: 0
fpu		: yes
fpu_exception	: yes
cpuid level	: 27
wp		: yes
flags		: fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush dts acpi mmx fxsr sse sse2 ss ht tm pbe syscall nx pdpe1gb rdtscp lm constant_tsc art arch_perfmon pebs bts rep_good nopl xtopology nonstop_tsc cpuid aperfmperf tsc_known_freq pni pclmulqdq dtes64 monitor ds_cpl vmx est tm2 ssse3 sdbg fma cx16 xtpr pdcm pcid sse4_1 sse4_2 x2apic movbe popcnt tsc_deadline_timer aes xsave avx f16c rdrand lahf_lm abm 3dnowprefetch cpuid_fault epb cat_l2 invpcid_single cdp_l2 ssbd ibrs ibpb stibp ibrs_enhanced tpr_shadow vnmi flexpriority ept vpid ept_ad fsgsbase tsc_adjust bmi1 avx2 smep bmi2 erms invpcid rdt_a avx512f avx512dq rdseed adx smap avx512ifma clflushopt clwb intel_pt avx512cd sha_ni avx512bw avx512vl xsaveopt xsavec xgetbv1 xsaves split_lock_detect dtherm ida arat pln pts hwp hwp_notify hwp_act_window hwp_epp hwp_pkg_req avx512vbmi umip pku ospke avx512_vbmi2 gfni vaes vpclmulqdq avx512_vnni avx512_bitalg avx512_vpopcntdq rdpid movdiri movdir64b fsrm avx512_vp2intersect md_clear flush_l1d arch_capabilities
vmx flags	: vnmi preemption_timer posted_intr invvpid ept_x_only ept_ad ept_1gb flexpriority apicv tsc_offset vtpr mtf vapic ept vpid unrestricted_guest vapic_reg vid ple pml ept_mode_based_exec tsc_scaling
bugs		: spectre_v1 spectre_v2 spec_store_bypass swapgs
bogomips	: 5608.00
clflush size	: 64
cache_alignment	: 64
address sizes	: 39 bits physical, 48 bits virtual
power management:

bogomips	: 5608.00
bogomips	: 5608.00
bogomips	: 5608.00
bogomips	: 5608.00
bogomips	: 5608.00
bogomips	: 5608.00
bogomips	: 5608.00
bogomips	: 5608.00
</pre>

<p>
It is closely related to the above benchmark and has a wikipedia article
<a href="https://en.wikipedia.org/wiki/BogoMips">https://en.wikipedia.org/wiki/BogoMips</a>
</p>

<p>
It was introduced in Linux-0.99.11 (July 17, 1993) in commit
5e736a6b1aac3994a22b08b6d7611ee2a39339ec
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-03-30</p>
<p class="author">Author: Krzysztof Piecuch</p>
<p class="date">Created: 2022-03-31 czw 10:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
